fonecmid-diplom/src/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОбработкаЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/CommonModules/ВКМ_ОбслуживаниеСервер/Ext/Module.bsl
// Эта процедура выполняется в фоновом режиме на сервере
Процедура ВыполнитьСоздание(Параметры) Экспорт
	
	Период = Параметры.Период; 
	
	МассивДоговоров = Параметры.МассивДоговоров;
	
	Для Каждого ДоговорRef Из МассивДоговоров Цикл
		
		// 1. Повторная проверка: вдруг кто-то уже создал документ, пока мы думали
		Если СуществуетДокументЗаПериод(ДоговорRef, Период) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			// 2. Создание нового документа
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = КонецМесяца(Период); // Обычно акты делают концом месяца
			
			// 3. Стандартное заполнение (Заполнение шапки)
			// Имитируем ввод на основании или просто заполнение по умолчанию
			ДанныеЗаполнения = Новый Структура("Договор", ДоговорRef);
			НовыйДокумент.Заполнить(ДанныеЗаполнения);
			
			// Явное присвоение, если стандартное заполнение не справилось с шапкой
			НовыйДокумент.Договор = ДоговорRef;
			// Получаем организацию и контрагента из договора (через точку можно, т.к. мы на сервере и это не цикл по 1000 строк выборки, а единичная операция создания)
			НовыйДокумент.Контрагент = ДоговорRef.Владелец; // Владелец договора - это контрагент
			НовыйДокумент.Организация = ДоговорRef.Организация;
			
			// 4. Метод модуля объекта: ВыполнитьАвтозаполнение (из прошлого задания)
			НовыйДокумент.ВыполнитьАвтозаполнение();
			
			// Если документ получился пустым (сумма 0), возможно его не надо записывать?
			// Но по заданию про это не сказано. Записываем.
			
			// 5. Проверка заполнения (Стандартный механизм)
			Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
				// Если есть ошибки заполнения, документ не проводим, но можно записать просто так
				// Или пропустить. В рамках задачи лучше записать непроведенным.
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			Иначе
				// 6. Проведение
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		Исключение
			// Логируем ошибку в Журнал Регистрации, чтобы фоновое задание не падало целиком
			ЗаписьЖурналаРегистрации("ВКМ_МассовоеСоздание", УровеньЖурналаРегистрации.Ошибка, , ДоговорRef, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

// Вспомогательная функция для проверки дублей
Функция СуществуетДокументЗаПериод(Договор, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реализация.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Реализация
		|ГДЕ
		|	Реализация.Договор = &Договор
		|	И НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	И НЕ Реализация.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Период);
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции
